Product/Production/Common/Interfaces/src/wsdl/AdapterComponentDocQueryDeferredRequest.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!-- 
  Adapter Component Document Query Deferred Request WSDL
  -->
<definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap12/" 
   xmlns="http://schemas.xmlsoap.org/wsdl/" 
   xmlns:tns="urn:gov:hhs:fha:nhinc:adaptercomponentdocquerydeferredrequest"
   xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
   xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0"
   xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
   xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy"
   xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
   xmlns:wsoma="http://schemas.xmlsoap.org/ws/2004/09/policy/optimizedmimeserialization"
   xmlns:nccommonadapter="urn:gov:hhs:fha:nhinc:common:nhinccommonadapter"
   xmlns:dq="http://www.hhs.gov/healthit/nhin"
   name="AdapterComponentDocQueryDeferredRequest" 
   targetNamespace="urn:gov:hhs:fha:nhinc:adaptercomponentdocquerydeferredrequest">
  <documentation>Adapter Component Document Query Deferred Request</documentation>
  <types>
    <xsd:schema>
      <xsd:import namespace="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" 
                  schemaLocation="../schemas/ebRS/query.xsd"/>
      <xsd:import namespace="urn:gov:hhs:fha:nhinc:common:nhinccommonadapter"
                  schemaLocation="../schemas/nhinc/common/NhincCommonAdapter.xsd"/>
      <xsd:import namespace="http://www.hhs.gov/healthit/nhin"
                  schemaLocation="../schemas/nhin/QueryDocument.xsd"/>
    </xsd:schema>
  </types>
  <message name="RespondingGateway_CrossGatewayQueryRequestMessage">
    <part name="RespondingGateway_CrossGatewayQueryRequest" 
          element="nccommonadapter:RespondingGateway_CrossGatewayQueryRequest"/>
  </message>
  <message name="AcknowledgementMessage">
    <part name="RespondingGateway_CrossGatewayQueryResponse" 
          element="dq:DocQueryAcknowledgement"/>
  </message>
  <portType name="AdapterComponentDocQueryDeferredRequestPortType">
    <operation name="RespondingGateway_CrossGatewayQuery">
      <input name="RespondingGateway_CrossGatewayQueryRequest"
             message="tns:RespondingGateway_CrossGatewayQueryRequestMessage" />
      <output name="AcknowledgementMessage"
              message="tns:AcknowledgementMessage" />
    </operation>
  </portType>
  <binding name="AdapterComponentDocQueryDeferredRequestBindingSoap" type="tns:AdapterComponentDocQueryDeferredRequestPortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="RespondingGateway_CrossGatewayQuery">
      <soap:operation soapAction="urn:RespondingGateway_CrossGatewayQuery"/>
      <input name="RespondingGateway_CrossGatewayQueryRequest">
        <soap:body use="literal"/>
      </input>
      <output name="AcknowledgementMessage">
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="AdapterComponentDocQueryDeferredRequest">
    <port name="AdapterComponentDocQueryDeferredRequestPortSoap"  binding="tns:AdapterComponentDocQueryDeferredRequestBindingSoap">
      <soap:address 
         location="http://localhost:${HttpDefaultPort}/NhinConnect/AdapterComponentDocQueryDeferredRequest" />
    </port>
  </service>
</definitions>
